# Operaciones CRUD en Cassandra

In [1]:
%load_ext cql

In [2]:
%cql DROP KEYSPACE demo

'No results.'

In [3]:
from cassandra.protocol import ConfigurationException

In [4]:
%%cql
CREATE KEYSPACE demo 
WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 1};

'No results.'

In [5]:
%keyspace demo

Using keyspace demo

In [6]:
%cql select release_version from system.local;

+-----------------+
| release_version |
+-----------------+
|      3.11.9     |
+-----------------+

In [7]:
%%cql
CREATE TABLE users (
    firstname text, 
    lastname text, 
    age int, 
    email text, 
    city text, 
    PRIMARY KEY (lastname)
);

'No results.'

In [8]:
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('John', 'Smith', 46, 'johnsmith@email.com', 'Sacramento'); 
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('Jane', 'Doe', 36, 'janedoe@email.com', 'Beverly Hills'); 
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('Rob', 'Byrne', 24, 'robbyrne@email.com', 'San Diego');

'No results.'

In [9]:
%cql SELECT * FROM users;

+----------+-----+---------------+---------------------+-----------+
| lastname | age |      city     |        email        | firstname |
+----------+-----+---------------+---------------------+-----------+
|   Doe    |  36 | Beverly Hills |  janedoe@email.com  |    Jane   |
|  Byrne   |  24 |   San Diego   |  robbyrne@email.com |    Rob    |
|  Smith   |  46 |   Sacramento  | johnsmith@email.com |    John   |
+----------+-----+---------------+---------------------+-----------+

In [10]:
%cql SELECT * FROM users WHERE lastname= 'Doe';

+----------+-----+---------------+-------------------+-----------+
| lastname | age |      city     |       email       | firstname |
+----------+-----+---------------+-------------------+-----------+
|   Doe    |  36 | Beverly Hills | janedoe@email.com |    Jane   |
+----------+-----+---------------+-------------------+-----------+

In [11]:
%cql UPDATE users SET city= 'San Jose' WHERE lastname= 'Doe';

'No results.'

In [12]:
%cql SELECT * FROM users where lastname= 'Doe';

+----------+-----+----------+-------------------+-----------+
| lastname | age |   city   |       email       | firstname |
+----------+-----+----------+-------------------+-----------+
|   Doe    |  36 | San Jose | janedoe@email.com |    Jane   |
+----------+-----+----------+-------------------+-----------+

In [13]:
%cql DELETE from users WHERE lastname = 'Doe';

'No results.'

In [14]:
%cql SELECT * FROM users;

+----------+-----+------------+---------------------+-----------+
| lastname | age |    city    |        email        | firstname |
+----------+-----+------------+---------------------+-----------+
|  Byrne   |  24 | San Diego  |  robbyrne@email.com |    Rob    |
|  Smith   |  46 | Sacramento | johnsmith@email.com |    John   |
+----------+-----+------------+---------------------+-----------+

In [15]:
%%cql 
SELECT * FROM users WHERE city = 'San Diego';

'Error from server: code=2200 [Invalid query] message="Cannot execute this query as it might involve data filtering and thus may have unpredictable performance. If you want to execute this query despite the performance unpredictability, use ALLOW FILTERING"'

In [16]:
%%cql 
SELECT * FROM users WHERE city = 'San Diego'
ALLOW FILTERING;

+----------+-----+-----------+--------------------+-----------+
| lastname | age |    city   |       email        | firstname |
+----------+-----+-----------+--------------------+-----------+
|  Byrne   |  24 | San Diego | robbyrne@email.com |    Rob    |
+----------+-----+-----------+--------------------+-----------+

In [ ]:
%%cql
CREATE INDEX users_city ON users(city)

In [ ]:
%%cql 
SELECT * FROM users WHERE city = 'San Diego';